caAERS/software/soapProjects/archive/DeleteAdverseEventsSOAP.xml

<!--
  Copyright SemanticBits, Northwestern University and Akaza Research
  
  Distributed under the OSI-approved BSD 3-Clause License.
  See http://ncip.github.com/caaers/LICENSE.txt for details.
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:adv="http://webservice.caaers.cabig.nci.nih.gov/adverseevent">
	<soapenv:Header/>
	<soapenv:Body>
		<adv:deleteAdverseEvent>
			<adv:AdverseEventsInputMessage>
				<adv:adverseEventTerms>
					<adverseEventCtcTerm>
						<ctep-term>Burn</ctep-term>
					</adverseEventCtcTerm>
					<adverseEventCtcTerm>
						<ctep-term>Aspiration</ctep-term>
					</adverseEventCtcTerm>
				</adv:adverseEventTerms>
				<adv:criteria>
					<participantIdentifier>DM-11</participantIdentifier>
					<studyIdentifier>6482</studyIdentifier>
					<course>
						<startDateOfThisCourse>2008-10-01</startDateOfThisCourse>
						<treatmentType>Treatment</treatmentType>
						<otherTreatmentAssignmentDescription>TAC1X</otherTreatmentAssignmentDescription>
					</course>
				</adv:criteria>
			</adv:AdverseEventsInputMessage>
		</adv:deleteAdverseEvent>
	</soapenv:Body>
</soapenv:Envelope>
