caAERS/software/soapProjects/archive/CreateOrUpdateAdverseEventsSOAP.xml

<!--
  Copyright SemanticBits, Northwestern University and Akaza Research
  
  Distributed under the OSI-approved BSD 3-Clause License.
  See http://ncip.github.com/caaers/LICENSE.txt for details.
-->
<soapenv:Envelope 
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:adv="http://webservice.caaers.cabig.nci.nih.gov/adverseevent"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
	<soapenv:Header>
		<wsse:Security>
			<wsse:UsernameToken>
				<wsse:Username>SYSTEM_ADMIN</wsse:Username>
				<wsse:Password>Hello-12</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>

   <soapenv:Body>
      <adv:createOrUpdateAdverseEvent>
         <adv:AdverseEventsInputMessage>

				<adv:adverseEvents>
					<adv:adverseEvent>
						<grade>3</grade>
						<hospitalization>NO</hospitalization>
						<expected>true</expected>
						<startDate>2012-03-20</startDate>
						<endDate>2012-03-20</endDate>
						<ctepCode>10013786</ctepCode> <!-- Dry Skin -->
					</adv:adverseEvent>
					<adv:adverseEvent>
						<grade>3</grade>
						<hospitalization>NO</hospitalization>
						<expected>true</expected>
						<startDate>2012-03-20</startDate>
						<endDate>2012-03-20</endDate>
						<ctepCode>10013774</ctepCode> <!-- Dry Eye -->
					</adv:adverseEvent>
					<adv:adverseEvent>
						<grade>3</grade>
						<hospitalization>NO</hospitalization>
						<expected>true</expected>
						<startDate>2012-03-20</startDate>
						<endDate>2012-03-20</endDate>
						<ctepCode>10002167</ctepCode> <!-- Anal pain -->
					</adv:adverseEvent>
				</adv:adverseEvents>

				<adv:criteria>
					<participantIdentifier>u8wdpOyT</participantIdentifier>
					<studyIdentifier>5876</studyIdentifier>
					<course>
						<startDateOfThisCourse>2012-03-20</startDateOfThisCourse>
						<treatmentType>Treatment</treatmentType>
						<otherTreatmentAssignmentDescription>TAC1X</otherTreatmentAssignmentDescription>
					</course>
				</adv:criteria>
         </adv:AdverseEventsInputMessage>
      </adv:createOrUpdateAdverseEvent>
   </soapenv:Body>
</soapenv:Envelope>
